ir_version: 3
producer_name: "CNTK"
producer_version: "2.5.1"
domain: "ai.cntk"
model_version: 1
graph {
  node {
    input: "Parameter193"
    input: "Parameter193_reshape1_shape"
    output: "Parameter193_reshape1"
    name: "Times212_reshape1"
    op_type: "Reshape"
    doc_string: ""
    domain: ""
  }
  node {
    input: "Input3"
    input: "Parameter5"
    output: "Convolution28_Output_0"
    name: "Convolution28"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "Convolution28_Output_0"
    input: "Parameter6"
    output: "Plus30_Output_0"
    name: "Plus30"
    op_type: "Add"
    doc_string: ""
    domain: ""
  }
  node {
    input: "Plus30_Output_0"
    output: "ReLU32_Output_0"
    name: "ReLU32"
    op_type: "Relu"
    doc_string: ""
    domain: ""
  }
  node {
    input: "ReLU32_Output_0"
    output: "Pooling66_Output_0"
    name: "Pooling66"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "Pooling66_Output_0"
    input: "Parameter87"
    output: "Convolution110_Output_0"
    name: "Convolution110"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "Convolution110_Output_0"
    input: "Parameter88"
    output: "Plus112_Output_0"
    name: "Plus112"
    op_type: "Add"
    doc_string: ""
    domain: ""
  }
  node {
    input: "Plus112_Output_0"
    output: "ReLU114_Output_0"
    name: "ReLU114"
    op_type: "Relu"
    doc_string: ""
    domain: ""
  }
  node {
    input: "ReLU114_Output_0"
    output: "Pooling160_Output_0"
    name: "Pooling160"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "Pooling160_Output_0"
    input: "Pooling160_Output_0_reshape0_shape"
    output: "Pooling160_Output_0_reshape0"
    name: "Times212_reshape0"
    op_type: "Reshape"
    doc_string: ""
    domain: ""
  }
  node {
    input: "Pooling160_Output_0_reshape0"
    input: "Parameter193_reshape1"
    output: "Times212_Output_0"
    name: "Times212"
    op_type: "MatMul"
    doc_string: ""
    domain: ""
  }
  node {
    input: "Times212_Output_0"
    input: "Parameter194"
    output: "Plus214_Output_0"
    name: "Plus214"
    op_type: "Add"
    doc_string: ""
    domain: ""
  }
  name: "CNTKGraph"
  initializer {
    dims: 16
    dims: 4
    dims: 4
    dims: 10
    data_type: FLOAT
    float_data: 0.09163288
    float_data: 0.1214359
    float_data: 0.085350648
    float_data: 0.12260686
    float_data: -0.098753974
    float_data: -0.11212449
    float_data: -0.035732843
    float_data: -0.096262112
    float_data: -0.14788732
    float_data: 0.034858938
    float_data: -0.048446525
    float_data: 0.13689263
    float_data: 0.1460547
    float_data: -0.11976931
    float_data: 0.20804054
    float_data: -0.2271333
    float_data: 0.42333591
    float_data: 0.058677204
    float_data: -0.16731592
    float_data: -0.37082842
    float_data: -0.19223924
    float_data: 0.094320133
    float_data: 0.0936918
    float_data: -0.010435561
    float_data: 0.23059231
    float_data: -0.45245731
    float_data: 0.0025008137
    float_data: -0.012435278
    float_data: 0.031778187
    float_data: -0.30429313
    float_data: 0.01802597
    float_data: 0.024281487
    float_data: 0.287353
    float_data: 0.17099047
    float_data: -0.074394591
    float_data: 0.017667523
    float_data: -0.10535763
    float_data: -0.081811368
    float_data: 0.059879284
    float_data: 0.00047348961
    float_data: -0.15350804
    float_data: 0.12062922
    float_data: 0.10765989
    float_data: 0.094459333
    float_data: -0.069850452
    float_data: -0.025683381
    float_data: 0.10913116
    float_data: -0.08317744
    float_data: 0.082579054
    float_data: -0.17570786
    float_data: -0.16816784
    float_data: 0.10513987
    float_data: -0.17431362
    float_data: -0.08228223
    float_data: 0.46474925
    float_data: 0.030260585
    float_data: -0.15933886
    float_data: 0.19958271
    float_data: -0.10104269
    float_data: -0.49454075
    float_data: 0.32958907
    float_data: 0.17750981
    float_data: 0.41138309
    float_data: 0.1232613
    float_data: -0.27575675
    float_data: -0.46629411
    float_data: -0.37127641
    float_data: -0.020994602
    float_data: -0.12800093
    float_data: 0.048560269
    float_data: 0.38166606
    float_data: -0.23197861
    float_data: 0.40788352
    float_data: 0.022658313
    float_data: 0.077862039
    float_data: -0.67018425
    float_data: -0.061176125
    float_data: 0.046767227
    float_data: -0.032938074
    float_data: 0.14224783
    float_data: -0.12855503
    float_data: 0.025974348
    float_data: -0.0089578843
    float_data: 0.17939205
    float_data: -0.033460341
    float_data: -0.0271584
    float_data: 0.13029633
    float_data: -0.045492373
    float_data: 0.053679481
    float_data: 0.021849707
    float_data: -0.005965759
    float_data: -0.049667284
    float_data: -0.15891378
    float_data: 0.10884328
    float_data: -0.17006619
    float_data: 0.34957272
    float_data: -0.17430224
    float_data: 0.16547889
    float_data: -0.14037012
    float_data: -0.17373389
    float_data: -0.036601726
    float_data: 0.040103555
    float_data: 0.19195737
    float_data: 0.042516638
    float_data: -0.16382536
    float_data: 0.44191346
    float_data: 0.07696633
    float_data: -0.43764266
    float_data: 0.049478061
    float_data: -0.23576991
    float_data: -0.098256446
    float_data: -0.4054715
    float_data: -0.37302208
    float_data: 0.24368943
    float_data: -0.52159578
    float_data: 0.56688881
    float_data: 0.55522227
    float_data: -0.10442957
    float_data: 0.18002772
    float_data: -0.11376107
    float_data: -0.039650016
    float_data: -0.11214318
    float_data: -0.0023703112
    float_data: -0.0031440046
    float_data: -0.10276812
    float_data: 0.019040678
    float_data: -0.072141565
    float_data: -0.062951542
    float_data: 0.08691363
    float_data: 0.059526339
    float_data: 0.18038589
    float_data: 0.10787898
    float_data: -0.19601597
    float_data: 0.008016468
    float_data: 0.063300394
    float_data: 0.01480228
    float_data: -0.071892738
    float_data: 0.10687674
    float_data: -0.24504678
    float_data: 0.015252113
    float_data: -0.33518225
    float_data: -0.032787889
    float_data: -0.15907159
    float_data: 0.58422935
    float_data: -0.073508859
    float_data: 0.515739
    float_data: 0.16114292
    float_data: -0.20041144
    float_data: 0.086110815
    float_data: -0.26673803
    float_data: -0.48252073
    float_data: 0.040459815
    float_data: -0.025883781
    float_data: 0.2995097
    float_data: -0.21764477
    float_data: 0.081163883
    float_data: 0.26656035
    float_data: -0.29017878
    float_data: 0.26659837
    float_data: -0.20305157
    float_data: -0.12429767
    float_data: 0.0059654196
    float_data: 0.22436281
    float_data: 0.13654104
    float_data: -0.028027369
    float_data: -0.28091878
    float_data: 0.022815384
    float_data: 0.06510894
    float_data: -0.14604154
    float_data: 0.10212377
    float_data: -0.13724956
    float_data: 0.056102585
    float_data: -0.081117436
    float_data: 0.0071120653
    float_data: -0.20668791
    float_data: 0.1132005
    float_data: -0.18013525
    float_data: 0.35981923
    float_data: -0.2298141
    float_data: 0.0077749467
    float_data: -0.21265364
    float_data: -0.1025082
    float_data: 0.0910964
    float_data: 0.27135184
    float_data: -0.14504372
    float_data: 0.087233305
    float_data: -0.070212528
    float_data: 0.13583463
    float_data: 0.11757422
    float_data: -0.0060818028
    float_data: -0.038574949
    float_data: 0.085977212
    float_data: 0.047411725
    float_data: -0.036640119
    float_data: 0.0816631
    float_data: 0.084217221
    float_data: 0.13474408
    float_data: -0.063030273
    float_data: 0.0055456385
    float_data: 0.0772921
    float_data: -0.024022099
    float_data: -0.073857963
    float_data: 0.24266241
    float_data: 0.2002832
    float_data: -0.12752441
    float_data: -0.375825
    float_data: -0.25733465
    float_data: 0.1702445
    float_data: -0.072719485
    float_data: -0.00042671076
    float_data: -0.035063796
    float_data: 0.25228849
    float_data: 0.2963089
    float_data: 0.17691506
    float_data: -0.40711546
    float_data: -0.17924666
    float_data: -0.48687738
    float_data: 0.74615538
    float_data: -0.043486707
    float_data: -0.040731341
    float_data: 0.056606047
    float_data: -0.28346652
    float_data: 0.067539431
    float_data: -0.27477723
    float_data: -0.29532
    float_data: 0.31945375
    float_data: -0.09977182
    float_data: 0.35889989
    float_data: -0.13710663
    float_data: -0.060716279
    float_data: 0.089188606
    float_data: -0.12389953
    float_data: -0.48140821
    float_data: -0.12098598
    float_data: -0.07548032
    float_data: 0.50706
    float_data: 0.16170549
    float_data: 0.033460673
    float_data: -0.012951419
    float_data: 0.10999502
    float_data: -0.18118232
    float_data: -0.20907186
    float_data: 0.17070118
    float_data: 0.20845625
    float_data: 0.10394178
    float_data: 0.16494232
    float_data: -0.051941235
    float_data: 0.29782093
    float_data: -0.11981763
    float_data: -0.17728861
    float_data: -0.14260271
    float_data: -0.0029032787
    float_data: -0.15693335
    float_data: -0.061181046
    float_data: 0.18368062
    float_data: 0.27372018
    float_data: -0.090101585
    float_data: -0.11838143
    float_data: 0.027254594
    float_data: 0.334325
    float_data: -0.14430532
    float_data: -0.28883854
    float_data: -0.25501281
    float_data: -0.097276524
    float_data: 0.57777059
    float_data: -0.29129004
    float_data: 0.18572754
    float_data: -0.2331863
    float_data: 0.18166631
    float_data: -0.010372465
    float_data: -0.038152643
    float_data: -0.089155689
    float_data: 0.64658386
    float_data: 0.1674061
    float_data: 0.12680207
    float_data: -0.097927213
    float_data: 0.21416533
    float_data: 0.26453227
    float_data: 0.053868193
    float_data: -0.75951433
    float_data: -0.20290551
    float_data: 0.348342
    float_data: -0.13746916
    float_data: 0.2868602
    float_data: 0.21477994
    float_data: 0.09853071
    float_data: -0.24042019
    float_data: 0.15954174
    float_data: -0.22677101
    float_data: 0.017160976
    float_data: 0.011399303
    float_data: 0.17518985
    float_data: 0.049924862
    float_data: 0.077433206
    float_data: -0.045792
    float_data: 0.024458969
    float_data: -0.051443838
    float_data: -0.48874712
    float_data: -0.065804876
    float_data: 0.10073553
    float_data: 0.26834318
    float_data: -0.039823323
    float_data: 0.097930923
    float_data: -0.039591666
    float_data: -0.076083891
    float_data: -0.00010426697
    float_data: 0.0326866
    float_data: -0.31194073
    float_data: 0.089076161
    float_data: -0.28973046
    float_data: -0.0789951
    float_data: 0.24833716
    float_data: 0.65597206
    float_data: -0.28959942
    float_data: 0.34634018
    float_data: -0.42760491
    float_data: -0.062536784
    float_data: 0.041399173
    float_data: -0.094824038
    float_data: -0.14266187
    float_data: 0.036459304
    float_data: -0.13176866
    float_data: 0.011298294
    float_data: -0.041946568
    float_data: -0.025355982
    float_data: -0.17728427
    float_data: 0.048711535
    float_data: 0.0071196328
    float_data: -0.035150558
    float_data: -0.12065277
    float_data: 0.038310621
    float_data: -0.19670185
    float_data: 0.15221554
    float_data: 0.066545479
    float_data: 0.026643498
    float_data: -0.18223408
    float_data: -0.20074368
    float_data: 0.24763468
    float_data: 0.1427248
    float_data: -0.012629205
    float_data: 0.12601867
    float_data: -0.018152546
    float_data: -0.011578285
    float_data: 0.113744
    float_data: -0.33338261
    float_data: -0.13109452
    float_data: -0.14465189
    float_data: 0.21875687
    float_data: 0.28940579
    float_data: 0.25008419
    float_data: 0.17396799
    float_data: 0.10197078
    float_data: -0.25614518
    float_data: -0.11203703
    float_data: -0.059131294
    float_data: 0.035207305
    float_data: -0.040823784
    float_data: -0.088401407
    float_data: -0.017499367
    float_data: 0.035032913
    float_data: -0.10343275
    float_data: 0.069423936
    float_data: 0.28200978
    float_data: 0.066551752
    float_data: -0.16650206
    float_data: 0.066178307
    float_data: -0.16453855
    float_data: 0.40850934
    float_data: 0.062596925
    float_data: -0.063614912
    float_data: -0.28389239
    float_data: 0.18313316
    float_data: 0.4944689
    float_data: 0.2967484
    float_data: -0.27168152
    float_data: -0.0076581524
    float_data: -0.49666068
    float_data: 0.34323797
    float_data: 0.09508498
    float_data: -0.27707073
    float_data: 0.19309349
    float_data: -0.24312331
    float_data: 0.22289844
    float_data: 0.18062271
    float_data: -0.34044212
    float_data: 0.024597464
    float_data: -0.12014613
    float_data: 0.33355567
    float_data: -0.23799658
    float_data: 0.030691465
    float_data: 0.020851705
    float_data: -0.057640593
    float_data: -0.012411107
    float_data: -0.25374025
    float_data: -0.33710703
    float_data: 0.49732125
    float_data: 0.4041796
    float_data: 0.022525912
    float_data: -0.22372337
    float_data: 0.0019890137
    float_data: -0.31899545
    float_data: 0.029870084
    float_data: 0.17537035
    float_data: 0.21442392
    float_data: 0.26710629
    float_data: 0.10951994
    float_data: -0.28308302
    float_data: 0.32767612
    float_data: 0.2755309
    float_data: -0.37709764
    float_data: -0.67420459
    float_data: -0.42423284
    float_data: -0.17566432
    float_data: 0.22207844
    float_data: 0.52586281
    float_data: 0.49852112
    float_data: -0.73421377
    float_data: -0.072462849
    float_data: -0.031770371
    float_data: 0.61411029
    float_data: 0.27530429
    float_data: -0.18157063
    float_data: 0.010792283
    float_data: 0.2778345
    float_data: 0.048652887
    float_data: 0.19194393
    float_data: -0.1422531
    float_data: 0.094153367
    float_data: -0.14221196
    float_data: -0.047758892
    float_data: 0.13818662
    float_data: 0.11377434
    float_data: -0.0022223089
    float_data: 0.012142995
    float_data: -0.12801841
    float_data: 0.21084507
    float_data: 0.098576263
    float_data: -0.007353052
    float_data: -0.0913769
    float_data: -0.186092
    float_data: 0.093677074
    float_data: 0.21986865
    float_data: 0.013781993
    float_data: 0.018539356
    float_data: 0.10021904
    float_data: 0.0575051
    float_data: 0.087401487
    float_data: -0.25919461
    float_data: 0.051177077
    float_data: 0.031620193
    float_data: 0.07561399
    float_data: -0.21551515
    float_data: -0.18499906
    float_data: 0.26917633
    float_data: -0.23229145
    float_data: 0.24011075
    float_data: 0.2137433
    float_data: -0.53323489
    float_data: -0.078756392
    float_data: 0.21177599
    float_data: 0.17055304
    float_data: 0.5362649
    float_data: -0.19951399
    float_data: -0.0056560091
    float_data: -0.19522618
    float_data: -0.12402368
    float_data: 0.06757839
    float_data: -0.12189233
    float_data: 0.05454839
    float_data: -0.30103686
    float_data: -0.00054895988
    float_data: 0.17150354
    float_data: 0.77024764
    float_data: -0.27090162
    float_data: 0.058912355
    float_data: -0.14350523
    float_data: -0.023597054
    float_data: -0.022250233
    float_data: -0.23405173
    float_data: -0.2757639
    float_data: 0.10074458
    float_data: -0.13297963
    float_data: -0.13568521
    float_data: 0.15051182
    float_data: 0.13589987
    float_data: -0.083647944
    float_data: 0.143349
    float_data: 0.1089863
    float_data: -0.10957677
    float_data: 0.004637918
    float_data: 0.0821246
    float_data: -0.056979027
    float_data: -0.03259952
    float_data: 0.16697386
    float_data: -0.11660593
    float_data: 0.13034111
    float_data: 0.1159108
    float_data: 0.084028542
    float_data: -0.1398447
    float_data: -0.0043391325
    float_data: -0.07553751
    float_data: 0.075294077
    float_data: 0.14620236
    float_data: -0.073161148
    float_data: -0.1649327
    float_data: -0.048173521
    float_data: 0.11424325
    float_data: -0.16561167
    float_data: -0.099320993
    float_data: -0.17314133
    float_data: 0.098062664
    float_data: 0.052351296
    float_data: 0.035868939
    float_data: 0.00025790485
    float_data: -0.11036415
    float_data: 0.079444937
    float_data: -0.014252503
    float_data: 0.044749871
    float_data: -0.096029371
    float_data: -0.065155134
    float_data: 0.018660665
    float_data: 0.10578679
    float_data: 0.11224555
    float_data: 0.17322432
    float_data: -0.065565504
    float_data: 0.032207806
    float_data: 0.066156976
    float_data: -0.10299636
    float_data: -0.045623023
    float_data: -0.090779744
    float_data: 0.085492045
    float_data: -0.068819463
    float_data: 0.32974881
    float_data: -0.13802692
    float_data: -0.062971257
    float_data: 0.17202683
    float_data: -0.057560258
    float_data: -0.1393673
    float_data: -0.27838939
    float_data: -0.0036408226
    float_data: -0.16849867
    float_data: 0.40088397
    float_data: 0.10527267
    float_data: -0.030056542
    float_data: -0.3140541
    float_data: -0.0065591033
    float_data: -0.018896759
    float_data: -0.023097863
    float_data: -0.20794691
    float_data: 0.1163993
    float_data: -0.045964979
    float_data: 0.12145293
    float_data: 0.11801191
    float_data: 0.3572183
    float_data: -0.18851322
    float_data: -0.13270958
    float_data: 0.21601921
    float_data: -0.071184181
    float_data: -0.060278703
    float_data: -0.014308637
    float_data: 0.098096065
    float_data: -0.10807335
    float_data: 0.030968409
    float_data: -0.097609274
    float_data: 0.024996085
    float_data: -0.24101898
    float_data: 0.027350249
    float_data: 0.002106643
    float_data: 0.11929166
    float_data: 0.096936829
    float_data: 0.31900787
    float_data: -0.16620038
    float_data: 0.16391498
    float_data: -0.24900873
    float_data: 0.032387134
    float_data: 0.095035806
    float_data: 0.063718423
    float_data: 0.39320061
    float_data: -0.39925221
    float_data: -0.18966803
    float_data: -0.24347422
    float_data: 0.37264863
    float_data: -0.35335422
    float_data: 0.0053221881
    float_data: -0.044945579
    float_data: 0.058481287
    float_data: -0.26220477
    float_data: -0.05913911
    float_data: -0.35598779
    float_data: 0.20696568
    float_data: 0.27022618
    float_data: 0.2154869
    float_data: -0.35742205
    float_data: -0.0089158863
    float_data: -0.39902923
    float_data: 0.013715313
    float_data: 0.026476033
    float_data: 0.14218163
    float_data: -0.20252009
    float_data: 0.27863765
    float_data: -0.00041795528
    float_data: -0.19249746
    float_data: 0.15893307
    float_data: -0.023107875
    float_data: 0.028147293
    float_data: 0.1165311
    float_data: -0.017896151
    float_data: -0.056495871
    float_data: -0.080031037
    float_data: -0.073782571
    float_data: -0.10359156
    float_data: 0.042670943
    float_data: 0.34554303
    float_data: -0.35548672
    float_data: 0.064546786
    float_data: -0.092807211
    float_data: 0.11624148
    float_data: 0.21442848
    float_data: 0.28783032
    float_data: -0.36001426
    float_data: -0.31429404
    float_data: 0.087994829
    float_data: -0.40366727
    float_data: 0.049285885
    float_data: 0.26043832
    float_data: -0.04560538
    float_data: -0.085108757
    float_data: 0.38491026
    float_data: 0.2517859
    float_data: 0.030066475
    float_data: -0.19147968
    float_data: 0.010460179
    float_data: -0.16427223
    float_data: 0.1013407
    float_data: 0.074302711
    float_data: 0.071573071
    float_data: -0.13403825
    float_data: -0.19174471
    float_data: 0.0045858216
    float_data: 0.012936335
    float_data: -0.016513359
    float_data: 0.0027255889
    float_data: -0.0091243191
    float_data: 0.11511059
    float_data: 0.068505324
    float_data: -0.10343108
    float_data: 0.11619291
    float_data: 0.015174217
    float_data: 0.027511923
    float_data: -0.029467288
    float_data: 0.087821409
    float_data: 0.17025547
    float_data: -0.10653657
    float_data: -0.11597806
    float_data: -0.13829486
    float_data: -0.012640769
    float_data: 0.10421433
    float_data: -0.072207421
    float_data: 0.042693838
    float_data: 0.0828627
    float_data: 0.016975056
    float_data: 0.25776041
    float_data: -0.11046063
    float_data: -0.14268111
    float_data: 0.08814548
    float_data: 0.23049873
    float_data: -0.040310621
    float_data: -0.075070947
    float_data: -0.31577343
    float_data: -0.022311317
    float_data: -0.14433537
    float_data: -0.072524287
    float_data: -0.15836476
    float_data: -0.15757196
    float_data: -0.066364326
    float_data: 0.35409591
    float_data: 0.0068687163
    float_data: 0.037796322
    float_data: -0.28033024
    float_data: 0.018679393
    float_data: 0.020666458
    float_data: 0.068741761
    float_data: 0.20166039
    float_data: 0.09627378
    float_data: -0.11800262
    float_data: 0.1203466
    float_data: -0.017264321
    float_data: 0.050676003
    float_data: 0.10920057
    float_data: -0.0425657
    float_data: -0.028189225
    float_data: 0.22206032
    float_data: 0.13020054
    float_data: -0.052751575
    float_data: 0.12463525
    float_data: 0.086308524
    float_data: 0.049558911
    float_data: 0.19407317
    float_data: -0.32703531
    float_data: -0.20531209
    float_data: -0.23826694
    float_data: -0.27690917
    float_data: 0.060951319
    float_data: 0.19507752
    float_data: 0.079651214
    float_data: -0.14788251
    float_data: -0.20177861
    float_data: -0.078611724
    float_data: -0.021125326
    float_data: 0.62237275
    float_data: -0.12796885
    float_data: -0.090952039
    float_data: -0.10552834
    float_data: 0.29063162
    float_data: -0.056140397
    float_data: 0.057904594
    float_data: -0.082868688
    float_data: 0.019389695
    float_data: 0.33965313
    float_data: -0.041522618
    float_data: -0.17489986
    float_data: 0.13207005
    float_data: -0.0145694
    float_data: -0.11774334
    float_data: 0.06858433
    float_data: -0.042672
    float_data: 0.14176086
    float_data: 0.063681282
    float_data: -0.19249129
    float_data: -0.11341242
    float_data: -0.01210175
    float_data: 0.10720602
    float_data: 0.30187279
    float_data: -0.12481964
    float_data: -0.03679987
    float_data: 0.29304084
    float_data: -0.2622757
    float_data: -0.053627096
    float_data: -0.084979273
    float_data: 0.12152071
    float_data: -0.0078463424
    float_data: -0.29597494
    float_data: 0.081624925
    float_data: 0.38433084
    float_data: 0.087794319
    float_data: 0.065599732
    float_data: 0.14728093
    float_data: 0.12533937
    float_data: -0.055610452
    float_data: 0.25164232
    float_data: -0.0015343481
    float_data: -0.1802928
    float_data: -0.16464253
    float_data: -0.11755516
    float_data: -0.11583522
    float_data: -0.10709151
    float_data: 0.1661853
    float_data: 0.088794895
    float_data: 0.1146164
    float_data: -0.19360025
    float_data: -0.1514248
    float_data: 0.055989243
    float_data: 0.13593945
    float_data: -0.030917671
    float_data: -0.012382415
    float_data: 0.082379341
    float_data: 0.06515523
    float_data: -0.059717856
    float_data: -0.14912677
    float_data: 0.12891757
    float_data: 0.24418595
    float_data: -0.16759712
    float_data: 0.08927612
    float_data: 0.03573741
    float_data: -0.089318939
    float_data: -0.0028734317
    float_data: -0.13407031
    float_data: -0.23093639
    float_data: 0.039058708
    float_data: -0.16724817
    float_data: 0.17862305
    float_data: -0.094337262
    float_data: -0.018776756
    float_data: 0.13703796
    float_data: -0.32226259
    float_data: 0.21761101
    float_data: 0.33198625
    float_data: -0.47562161
    float_data: 0.44754621
    float_data: -0.30787164
    float_data: -0.15269382
    float_data: 0.18217947
    float_data: -0.08886113
    float_data: 0.16506533
    float_data: 0.041541643
    float_data: 0.18264486
    float_data: 0.0028657126
    float_data: -0.30466267
    float_data: 0.15093721
    float_data: -0.067663
    float_data: -0.16677311
    float_data: -0.13767512
    float_data: 0.087007955
    float_data: -0.040442098
    float_data: -0.036984619
    float_data: -0.1809245
    float_data: 0.041050959
    float_data: 0.12430304
    float_data: -0.042396281
    float_data: -0.063713893
    float_data: -0.13563295
    float_data: 0.09007594
    float_data: 0.14395377
    float_data: 0.19690566
    float_data: -0.030341407
    float_data: 0.045684002
    float_data: 0.065772571
    float_data: -0.047240969
    float_data: 0.089119561
    float_data: 0.040351652
    float_data: -0.052274037
    float_data: -0.15577835
    float_data: 0.19228858
    float_data: 0.13543138
    float_data: -0.011749577
    float_data: 0.063122362
    float_data: -0.027514022
    float_data: 0.019690584
    float_data: -0.076313272
    float_data: 0.040844131
    float_data: -0.033644527
    float_data: -0.070049539
    float_data: -0.04987197
    float_data: -0.14742254
    float_data: 0.050484277
    float_data: -0.015130468
    float_data: 0.10818116
    float_data: 0.099206261
    float_data: -0.13659436
    float_data: -0.040514313
    float_data: -0.090934113
    float_data: 0.2356915
    float_data: -0.25967866
    float_data: -0.044388693
    float_data: 0.028831076
    float_data: 0.051760755
    float_data: 0.0038893034
    float_data: 0.15690291
    float_data: 0.10129069
    float_data: -0.20741795
    float_data: -0.094032332
    float_data: 0.25492314
    float_data: -0.15159388
    float_data: -0.37808698
    float_data: 0.14954345
    float_data: 0.10286098
    float_data: -0.21811266
    float_data: -0.00087687717
    float_data: -0.11623913
    float_data: 0.090860188
    float_data: 0.53183144
    float_data: 0.18482342
    float_data: 0.1546531
    float_data: -0.076999679
    float_data: 0.075713225
    float_data: 0.23994295
    float_data: -0.45164183
    float_data: 0.0020482822
    float_data: -0.39811355
    float_data: -0.13066137
    float_data: -0.024989558
    float_data: 0.068977863
    float_data: -0.041593496
    float_data: 0.065664805
    float_data: -0.063461736
    float_data: 0.046806302
    float_data: -0.012553819
    float_data: -0.11576959
    float_data: -0.23319498
    float_data: -0.27680197
    float_data: -0.013630803
    float_data: -0.29240853
    float_data: -0.40207732
    float_data: -0.36694288
    float_data: 0.33643907
    float_data: -0.05036816
    float_data: -0.041783087
    float_data: -0.25996798
    float_data: 0.29979238
    float_data: 0.43801802
    float_data: 0.059686862
    float_data: -0.0079051005
    float_data: -0.38147321
    float_data: -0.21906282
    float_data: 0.25176504
    float_data: 0.17369649
    float_data: -0.17449452
    float_data: -0.15468837
    float_data: 0.18083166
    float_data: 0.35774893
    float_data: -0.0437999
    float_data: 0.37145716
    float_data: -0.4525376
    float_data: 0.18728252
    float_data: -0.013136982
    float_data: -0.14299287
    float_data: -0.57544541
    float_data: -0.12922727
    float_data: 0.17329921
    float_data: 0.38266072
    float_data: 0.15334886
    float_data: -0.15947269
    float_data: 0.037097383
    float_data: -0.017344035
    float_data: -0.034518681
    float_data: -0.1748344
    float_data: 0.10900342
    float_data: 0.074997187
    float_data: 0.1522145
    float_data: -0.041262459
    float_data: 0.067775935
    float_data: -0.15502374
    float_data: 0.16354631
    float_data: 0.22785421
    float_data: 0.046848815
    float_data: -0.029828466
    float_data: 0.10399839
    float_data: -0.18968293
    float_data: 0.13570717
    float_data: -0.0902257
    float_data: 0.26327604
    float_data: -0.28464082
    float_data: 0.64809507
    float_data: -0.13615
    float_data: 0.064600579
    float_data: 0.030096458
    float_data: 0.27705842
    float_data: -0.22201182
    float_data: 0.1610418
    float_data: -0.23982786
    float_data: -0.22440769
    float_data: -0.01426277
    float_data: 0.45522407
    float_data: -0.014287739
    float_data: -0.19704768
    float_data: -0.27394959
    float_data: 0.17722735
    float_data: 0.072221823
    float_data: -0.11947584
    float_data: -0.071904555
    float_data: 0.10904071
    float_data: -0.17517202
    float_data: -0.089038461
    float_data: 0.17170043
    float_data: -0.059558906
    float_data: 0.11402436
    float_data: 0.16522062
    float_data: -0.35160521
    float_data: -0.034481168
    float_data: -0.11740123
    float_data: -0.13413998
    float_data: -0.16011584
    float_data: 0.26411507
    float_data: 0.10897932
    float_data: -0.089425936
    float_data: -0.17326206
    float_data: -0.054331977
    float_data: 0.045789894
    float_data: 0.081679933
    float_data: 0.085113056
    float_data: 0.080212742
    float_data: -0.24175073
    float_data: 0.37225348
    float_data: -0.10094456
    float_data: -0.15668233
    float_data: 0.05091349
    float_data: 0.19977765
    float_data: -0.2448919
    float_data: 0.13482235
    float_data: 0.0021940013
    float_data: -0.031168083
    float_data: 0.12135771
    float_data: -0.12688792
    float_data: -0.18958107
    float_data: 0.16667391
    float_data: 0.030471629
    float_data: 0.1550452
    float_data: -0.052737027
    float_data: 0.026271472
    float_data: -0.22745742
    float_data: -0.13437311
    float_data: 0.30570212
    float_data: -0.092977852
    float_data: -0.18475755
    float_data: 0.39956319
    float_data: -0.22119898
    float_data: 0.17216288
    float_data: -0.029635321
    float_data: 0.10997044
    float_data: -0.09030433
    float_data: -0.0034450879
    float_data: 0.14845051
    float_data: 0.051591478
    float_data: 0.17100531
    float_data: 0.020391153
    float_data: -0.27374196
    float_data: -0.22581849
    float_data: -0.14499277
    float_data: -0.050254352
    float_data: 0.25733504
    float_data: 0.17892238
    float_data: -0.41638413
    float_data: 0.02373533
    float_data: -0.17261526
    float_data: -0.51024115
    float_data: 0.12343695
    float_data: -0.30591854
    float_data: 0.03734532
    float_data: 0.19263741
    float_data: 0.47267166
    float_data: -0.10874236
    float_data: 0.006102426
    float_data: -0.046458133
    float_data: -0.48704058
    float_data: 0.040322781
    float_data: 0.084679656
    float_data: 0.51375145
    float_data: -0.065562561
    float_data: 0.15030834
    float_data: -0.040173974
    float_data: -0.21601969
    float_data: 0.24490106
    float_data: -0.13502102
    float_data: 0.10465565
    float_data: 0.719252
    float_data: -0.12715119
    float_data: -0.26400426
    float_data: 0.12273197
    float_data: 0.0035119329
    float_data: -0.62216115
    float_data: 0.063863367
    float_data: 0.029396679
    float_data: 0.33604482
    float_data: -0.0294852
    float_data: 0.10902433
    float_data: 0.11317962
    float_data: -0.20234442
    float_data: 0.24299386
    float_data: 0.10908794
    float_data: -0.323201
    float_data: -0.14192493
    float_data: -0.064451993
    float_data: 0.1999353
    float_data: 0.033440061
    float_data: -0.011840429
    float_data: 0.023170194
    float_data: 0.032493837
    float_data: 0.099180654
    float_data: 0.0087817144
    float_data: -0.42465159
    float_data: 0.12794848
    float_data: 0.34636876
    float_data: -0.28624254
    float_data: 0.26846349
    float_data: 0.20964421
    float_data: -0.19132166
    float_data: 0.33055386
    float_data: -0.30350015
    float_data: -0.0025937879
    float_data: -0.12513977
    float_data: 0.23763184
    float_data: 0.24581365
    float_data: 0.20030765
    float_data: -0.11234287
    float_data: -0.25250015
    float_data: -0.11338274
    float_data: -0.32861951
    float_data: -0.21313956
    float_data: -0.075293474
    float_data: 0.38539052
    float_data: -0.23673047
    float_data: 0.4138971
    float_data: -0.11850415
    float_data: 0.040505793
    float_data: 0.058680896
    float_data: 0.42840219
    float_data: -0.33250946
    float_data: -0.018637601
    float_data: -0.29963624
    float_data: -0.089909539
    float_data: -0.10388949
    float_data: 0.0031918511
    float_data: -0.12570688
    float_data: -0.038307786
    float_data: -0.40914747
    float_data: 0.023242608
    float_data: -0.17890839
    float_data: 0.3214879
    float_data: -0.25526425
    float_data: 0.11098346
    float_data: 0.1002271
    float_data: 0.12840623
    float_data: 0.0030893232
    float_data: 0.12838078
    float_data: -0.10303178
    float_data: 0.22976282
    float_data: -0.31235516
    float_data: 0.14639695
    float_data: 0.051804543
    float_data: 0.18107547
    float_data: -0.076247096
    float_data: 0.016001012
    float_data: -0.24331941
    float_data: 0.30368733
    float_data: -0.42612645
    float_data: 0.27249193
    float_data: 0.038118903
    float_data: 0.015780758
    float_data: 0.31527478
    float_data: -0.021301929
    float_data: 0.04902941
    float_data: -0.01310969
    float_data: 0.069025464
    float_data: 0.0060031204
    float_data: -0.1825354
    float_data: 0.089751795
    float_data: 0.028871646
    float_data: -0.0373574
    float_data: 0.12274016
    float_data: 0.062204853
    float_data: 0.10932951
    float_data: -0.091018111
    float_data: 0.16965115
    float_data: -0.32301685
    float_data: -0.14145389
    float_data: 0.25746065
    float_data: 0.12483194
    float_data: -0.053706657
    float_data: 0.0067763277
    float_data: 0.029081006
    float_data: -0.0083270231
    float_data: 0.18339494
    float_data: 0.012635316
    float_data: -0.059541717
    float_data: 0.0070755924
    float_data: 0.16139996
    float_data: 0.051673137
    float_data: -0.03312039
    float_data: -0.14678755
    float_data: -0.0417942
    float_data: 0.02433621
    float_data: -0.040317982
    float_data: -0.071984932
    float_data: -0.062111922
    float_data: -0.09906856
    float_data: -0.077606246
    float_data: 0.12499915
    float_data: 0.05696331
    float_data: 0.087717094
    float_data: 0.12930439
    float_data: -0.0029950929
    float_data: -0.10194439
    float_data: 0.0026786516
    float_data: -0.070133686
    float_data: 0.095564611
    float_data: 0.15670072
    float_data: 0.10396437
    float_data: 0.14370759
    float_data: -0.19855121
    float_data: 0.20064552
    float_data: -0.2486838
    float_data: 0.017768236
    float_data: 0.10713238
    float_data: 0.49292839
    float_data: -0.26857102
    float_data: -0.12122424
    float_data: -0.12699841
    float_data: 0.052571893
    float_data: -0.26939893
    float_data: -0.10755529
    float_data: 0.19760534
    float_data: 0.20846695
    float_data: 0.18844573
    float_data: -0.1150398
    float_data: -0.30529141
    float_data: -0.11682814
    float_data: -0.34781256
    float_data: 0.52072662
    float_data: -0.47126383
    float_data: -0.23284949
    float_data: 0.15462813
    float_data: 0.25602451
    float_data: 0.18089651
    float_data: -0.34915689
    float_data: -0.0832585
    float_data: -0.08207681
    float_data: 0.20258057
    float_data: 0.171142
    float_data: -0.17644832
    float_data: -0.17375156
    float_data: 0.27033633
    float_data: -0.080974363
    float_data: 0.071271822
    float_data: -0.45104757
    float_data: 0.068337575
    float_data: -0.061998945
    float_data: 0.26766682
    float_data: -0.034746155
    float_data: 0.045132864
    float_data: 0.028333113
    float_data: -0.053918153
    float_data: 0.27216417
    float_data: 0.12015949
    float_data: -0.052361488
    float_data: 0.055820022
    float_data: 0.0011276945
    float_data: -0.097880468
    float_data: 0.0894252
    float_data: 0.24042055
    float_data: -0.166656
    float_data: -0.16350886
    float_data: 0.17995152
    float_data: -0.0088911271
    float_data: -0.02830039
    float_data: -0.12864369
    float_data: 0.038298983
    float_data: -0.0079979124
    float_data: 0.4160533
    float_data: -0.20639473
    float_data: -0.1286027
    float_data: 0.13437971
    float_data: -0.002044894
    float_data: -0.27876726
    float_data: -0.28955877
    float_data: -0.12267676
    float_data: -0.14330615
    float_data: 0.12025397
    float_data: -0.020110158
    float_data: 0.029675573
    float_data: -0.032737672
    float_data: 0.085386544
    float_data: -0.0058216946
    float_data: 0.27699474
    float_data: -0.09291596
    float_data: 0.040738475
    float_data: -0.064867772
    float_data: 0.067352735
    float_data: -0.40732092
    float_data: 0.17678787
    float_data: -0.050112631
    float_data: -0.44351816
    float_data: 0.13301398
    float_data: -0.0031333291
    float_data: -0.56902224
    float_data: 0.35323182
    float_data: -0.15320757
    float_data: 0.072061308
    float_data: 0.34108296
    float_data: -0.015670016
    float_data: 0.019037077
    float_data: -0.11005115
    float_data: -0.14040494
    float_data: 0.082162939
    float_data: 0.31533906
    float_data: 0.31822947
    float_data: -0.0022590586
    float_data: 0.03296921
    float_data: -0.073620245
    float_data: -0.23191257
    float_data: 0.082881056
    float_data: 0.33050337
    float_data: -0.1170502
    float_data: -0.13865496
    float_data: 0.11741789
    float_data: -0.11859155
    float_data: 0.24399985
    float_data: 0.01046438
    float_data: -0.16304252
    float_data: -0.099389121
    float_data: -0.10205717
    float_data: -0.035569627
    float_data: -0.19905141
    float_data: 0.18492334
    float_data: 0.00065539789
    float_data: -0.011041722
    float_data: -0.046466779
    float_data: 0.18075514
    float_data: -0.20811248
    float_data: -0.010684727
    float_data: 0.11008577
    float_data: -0.32202944
    float_data: -0.055057555
    float_data: 0.29091495
    float_data: 0.20048213
    float_data: -0.2963689
    float_data: -0.07224384
    float_data: 0.19180258
    float_data: -0.48387814
    float_data: 0.2876496
    float_data: 0.14055181
    float_data: 0.27958241
    float_data: -0.036532965
    float_data: 0.080839425
    float_data: -0.17095451
    float_data: -0.12441228
    float_data: -0.27037311
    float_data: 0.3889429
    float_data: -0.35034752
    float_data: -0.099318542
    float_data: 0.40855515
    float_data: 0.16394672
    float_data: 0.23487175
    float_data: -0.082329631
    float_data: -0.23346917
    float_data: 0.24082491
    float_data: 0.051764663
    float_data: 0.26732633
    float_data: -0.099583335
    float_data: -0.14812098
    float_data: -0.15910204
    float_data: 0.045940749
    float_data: 0.11871194
    float_data: -0.24328405
    float_data: -0.1403534
    float_data: 0.20764798
    float_data: -0.1845549
    float_data: 0.1585957
    float_data: 0.12459331
    float_data: -0.026588824
    float_data: 0.050125815
    float_data: 0.020598596
    float_data: 0.057901062
    float_data: -0.0643743
    float_data: -0.015592401
    float_data: 0.14860666
    float_data: -0.10468283
    float_data: -0.12643377
    float_data: -0.16123638
    float_data: 0.028019972
    float_data: -0.17007689
    float_data: 0.15781885
    float_data: 0.12043141
    float_data: -0.16491832
    float_data: 0.36278823
    float_data: -0.2666024
    float_data: -0.14166859
    float_data: 0.095348366
    float_data: 0.06331297
    float_data: -0.42564124
    float_data: -0.093228206
    float_data: 0.067735963
    float_data: 0.1038305
    float_data: 0.35421863
    float_data: 0.01033642
    float_data: -0.080885515
    float_data: -0.050608043
    float_data: -0.2010881
    float_data: 0.021329276
    float_data: 0.18400887
    float_data: -0.16932893
    float_data: 0.022277351
    float_data: -0.10980164
    float_data: -0.07443203
    float_data: -0.57504797
    float_data: 0.35376465
    float_data: 0.12063732
    float_data: 0.20547654
    float_data: -0.032150462
    float_data: 0.13241805
    float_data: -0.2364824
    float_data: -0.092828311
    float_data: -0.12945804
    float_data: 0.10844548
    float_data: -0.47364748
    float_data: -0.047015309
    float_data: -0.24530809
    float_data: -0.11569868
    float_data: -0.1835617
    float_data: 1.186131
    float_data: -0.21026891
    float_data: -0.137194
    float_data: -0.084514864
    float_data: 0.4066081
    float_data: 0.16870488
    float_data: 0.11400485
    float_data: 0.12349722
    float_data: -0.35529417
    float_data: 0.19179904
    float_data: -0.18502253
    float_data: 0.065581709
    float_data: 0.20025657
    float_data: -0.08179304
    float_data: -0.19173673
    float_data: -0.084483407
    float_data: -0.085311294
    float_data: -0.005563742
    float_data: -0.2091682
    float_data: 0.085576482
    float_data: 0.003214851
    float_data: 0.0368523
    float_data: 0.037803005
    float_data: -0.12156191
    float_data: 0.10448916
    float_data: 0.023453612
    float_data: -0.11003841
    float_data: 0.058686614
    float_data: -0.055489097
    float_data: -0.0031452461
    float_data: -0.098148942
    float_data: 0.05643804
    float_data: -0.083163574
    float_data: -0.071261436
    float_data: -0.3301129
    float_data: 0.21189186
    float_data: -0.034644365
    float_data: 0.19138382
    float_data: 0.12992685
    float_data: 0.1062365
    float_data: -0.23683488
    float_data: 0.10848058
    float_data: -0.31136721
    float_data: 0.16969258
    float_data: -0.077528253
    float_data: 0.510507
    float_data: 0.11774749
    float_data: 0.18304597
    float_data: -0.1715136
    float_data: 0.21025455
    float_data: -0.29864708
    float_data: 0.38012037
    float_data: -0.012968609
    float_data: 0.072469108
    float_data: -0.26793164
    float_data: 0.20185003
    float_data: -0.047206707
    float_data: 0.12408567
    float_data: -0.066401079
    float_data: 0.067745671
    float_data: -0.0656038
    float_data: 0.056146082
    float_data: -0.033377707
    float_data: -0.046186104
    float_data: -0.11172571
    float_data: -0.0058390265
    float_data: 0.011888879
    float_data: -0.020986518
    float_data: 0.25051105
    float_data: -0.10963256
    float_data: -0.0080538522
    float_data: -0.23716502
    float_data: -0.0041796905
    float_data: 0.21066943
    float_data: -0.1030085
    float_data: -0.085161351
    float_data: -0.054498177
    float_data: 0.1742405
    float_data: 0.26345995
    float_data: -0.15705398
    float_data: -0.013422469
    float_data: -0.13424604
    float_data: 0.017209968
    float_data: 0.10991669
    float_data: 0.12187642
    float_data: -0.15396069
    float_data: 0.11919951
    float_data: 0.040043749
    float_data: 0.21384089
    float_data: -0.17836916
    float_data: 0.086985819
    float_data: -0.24995124
    float_data: -0.057436965
    float_data: 0.04811376
    float_data: -0.028344717
    float_data: 0.035967682
    float_data: -0.054026823
    float_data: 0.039885476
    float_data: 0.19367027
    float_data: -0.086330406
    float_data: 0.095353849
    float_data: -0.080779269
    float_data: 0.12632558
    float_data: -0.10908279
    float_data: -0.29351375
    float_data: -0.070664115
    float_data: -0.11034258
    float_data: 0.32503363
    float_data: 0.1094895
    float_data: -0.042040542
    float_data: 0.18463936
    float_data: -0.087884508
    float_data: -0.051259737
    float_data: 0.091634959
    float_data: -0.073133886
    float_data: -0.10762645
    float_data: 0.21273392
    float_data: 0.2173582
    float_data: 0.08536955
    float_data: -0.24166392
    float_data: 0.015557408
    float_data: 0.14594786
    float_data: 0.25281522
    float_data: -0.090936877
    float_data: 0.15102309
    float_data: -0.04449622
    float_data: 0.13443466
    float_data: -0.12773897
    float_data: -0.19595775
    float_data: 0.32715
    float_data: -0.37097365
    float_data: -0.36066279
    float_data: 0.16390216
    float_data: -0.19797906
    float_data: -0.21479395
    float_data: 0.20640936
    float_data: -0.12935905
    float_data: -0.048107661
    float_data: 0.11872942
    float_data: -0.0089127729
    float_data: 0.067277044
    float_data: -0.23403886
    float_data: 0.0041177771
    float_data: -0.34854007
    float_data: -0.3076773
    float_data: -0.12646033
    float_data: -0.017402198
    float_data: -0.041844975
    float_data: 0.40265971
    float_data: -0.17707951
    float_data: 0.26457468
    float_data: 0.17753339
    float_data: 0.037757751
    float_data: -0.042818651
    float_data: -0.23177896
    float_data: 0.059190892
    float_data: -0.15604664
    float_data: 0.012211055
    float_data: 0.089573577
    float_data: -0.17655152
    float_data: 0.055120371
    float_data: -0.16276082
    float_data: 0.086644635
    float_data: 0.40730405
    float_data: -0.29626778
    float_data: -0.24978837
    float_data: 0.14562276
    float_data: 0.12931009
    float_data: -0.41971478
    float_data: 0.054579258
    float_data: -0.15373594
    float_data: 0.22512257
    float_data: 0.083172716
    float_data: -0.16240436
    float_data: -0.090454027
    float_data: 0.047388319
    float_data: 0.12446753
    float_data: -0.021907682
    float_data: -0.090756714
    float_data: -0.14678909
    float_data: -0.099022441
    float_data: 0.18366614
    float_data: 0.074997254
    float_data: -0.24858563
    float_data: 0.271024
    float_data: -0.032212581
    float_data: 0.13325551
    float_data: -0.060472261
    float_data: 0.076046608
    float_data: -0.17361875
    float_data: 0.18074837
    float_data: -0.30523872
    float_data: 0.10779628
    float_data: 0.0077940924
    float_data: 0.087065168
    float_data: -0.2803067
    float_data: -0.14289571
    float_data: -0.5128603
    float_data: 0.2254359
    float_data: 0.12629014
    float_data: 0.27167997
    float_data: -0.042783283
    float_data: -0.74754149
    float_data: 0.048417822
    float_data: 0.17133012
    float_data: -0.25859064
    float_data: 0.77268761
    float_data: -0.39873609
    float_data: -0.38234851
    float_data: 0.57967561
    float_data: -0.25540218
    float_data: 0.71073633
    float_data: -0.25127161
    float_data: -0.081351757
    float_data: 0.12713563
    float_data: -0.06093305
    float_data: 0.23330548
    float_data: 0.028567597
    float_data: -0.094371982
    float_data: -0.11492605
    float_data: 0.033605147
    float_data: 0.19110143
    float_data: -0.069291785
    float_data: -0.049172096
    float_data: -0.068511054
    float_data: -0.051826458
    float_data: -0.17628558
    float_data: -0.18564372
    float_data: -0.088431038
    float_data: 0.15907913
    float_data: 0.036970876
    float_data: 0.082532592
    float_data: 0.044572506
    float_data: -0.026303235
    float_data: -0.070673667
    float_data: 0.1081557
    float_data: 0.0081861233
    float_data: -0.1719531
    float_data: 0.16080371
    float_data: -0.079488665
    float_data: 0.052306302
    float_data: 0.22820841
    float_data: -0.30551738
    float_data: 0.10781541
    float_data: 0.054907996
    float_data: 0.41060534
    float_data: 0.012804289
    float_data: -0.18495227
    float_data: 0.10083245
    float_data: 0.029780939
    float_data: -0.22310878
    float_data: -0.10674408
    float_data: -0.28648153
    float_data: 0.0027282776
    float_data: -0.01875964
    float_data: 0.027877646
    float_data: -0.028210364
    float_data: 0.17701429
    float_data: -0.0011380679
    float_data: -0.16933261
    float_data: 0.0456418
    float_data: -0.12622622
    float_data: -0.097073391
    float_data: -0.10689827
    float_data: 0.0637047
    float_data: -0.049210981
    float_data: -0.13353546
    float_data: -0.12757884
    float_data: 0.023957968
    float_data: 0.021759909
    float_data: 0.077890985
    float_data: -0.16637714
    float_data: 0.22396283
    float_data: 0.18783739
    float_data: -0.12122247
    float_data: 0.059836838
